slurm/originalCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

dynamicRefineFvMeshCoeffs
{
    refineInterval 25;
    field           CWater;
    lowerRefineLevel -0.99;
    upperRefineLevel 0.99;
    unrefineLevel   10;
    nBufferLayers   3;
    maxRefinement   4;
    maxCells        20000000;
    correctFluxes
    (
        (
            phi
            U
	    rhoPhi
	    ghf
	    rho*phi
        )
    );
    dumpLevel       true;
}

// ************************************************************************* //
