slurm/originalCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- TODO: remove (needed here for BC)
sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.072;

//- fluid properties (new syntax)
phases
(
    water
    {
        transportModel Newtonian;
        nu nu [ 0 2 -1 0 0 0 0 ]    0.92e-6;
        rho rho [ 1 -3 0 0 0 0 0 ]  1000;
    }

    air
    {
        transportModel Newtonian;
        nu nu [ 0 2 -1 0 0 0 0 ]    1.8e-5; 
        rho rho [ 1 -3 0 0 0 0 0 ]  1;
    }
);

refPhase        water;

meanFaceViscosity "blended";

// ************************************************************************* //
